In [46]:
import pandas as pd

In [59]:
dates = pd.date_range('1/1/2000','1/1/2021', periods=7)
dates

DatetimeIndex(['2000-01-01 00:00:00', '2003-07-02 12:00:00',
               '2007-01-01 00:00:00', '2010-07-02 12:00:00',
               '2014-01-01 00:00:00', '2017-07-02 12:00:00',
               '2021-01-01 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [48]:
import numpy as np
ts = pd.Series(np.arange(7), index=dates)
ts

2000-01-01 00:00:00    0
2003-07-02 12:00:00    1
2007-01-01 00:00:00    2
2010-07-02 12:00:00    3
2014-01-01 00:00:00    4
2017-07-02 12:00:00    5
2021-01-01 00:00:00    6
dtype: int32

In [49]:
# storing a data to a file
tmseries = ts.to_csv('C:/Users/charles/Desktop/Jupiter/tutorial_py/pandas/tmseries.csv', sep=',')

In [50]:
data = pd.DataFrame([[1,'lucy', '1N', 'Maths'],
             [2, 'Evans', '1M', 'science'],
             ['', 'Njoro', '', 'Physics'],
             [4, 'Jane', '4j', 'CRE'],
                    [5, 'njogu', '', 'comp']],
            columns=['Position', 'Name', 'Class', 'Subject'],)
data

  Position   Name Class  Subject
0        1   lucy    1N    Maths
1        2  Evans    1M  science
2           Njoro        Physics
3        4   Jane    4j      CRE
4        5  njogu           comp

In [51]:
dates = pd.date_range('1/1/2000', '1/1/2005', periods=5)
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [52]:
try:
    data.to_csv('C:/Users/charles/Desktop/Jupiter/tutorial_py/pandas/class_position.csv', index= False, na_rep='NULL', sep='@')
except PermissionError as e:
    print(e)
else:
    print("successful!")

successful!

In [53]:
data1 = pd.read_csv("C:\\Users\\charles\\Desktop\\Jupiter\\tutorial_py\\pandas\\class_position.csv", sep='@')
data1['dates'] = dates
data1

   Position   Name Class  Subject               dates
0       1.0   lucy    1N    Maths 2000-01-01 00:00:00
1       2.0  Evans    1M  science 2001-04-01 18:00:00
2       NaN  Njoro   NaN  Physics 2002-07-02 12:00:00
3       4.0   Jane    4j      CRE 2003-10-02 06:00:00
4       5.0  njogu   NaN     comp 2005-01-01 00:00:00

In [54]:
try:
    data1.to_csv('C:/Users/charles/Desktop/Jupiter/tutorial_py/pandas/class_position1.csv', index= False, na_rep='NULL', sep='@')
except PermissionError as e:
    print(e)
else:
    print("successful!")

successful!

In [55]:
data1 = pd.read_csv("C:\\Users\\charles\\Desktop\\Jupiter\\tutorial_py\\pandas\\class_position1.csv", index_col='dates', sep='@')
data1

                     Position   Name Class  Subject
dates
2000-01-01 00:00:00       1.0   lucy    1N    Maths
2001-04-01 18:00:00       2.0  Evans    1M  science
2002-07-02 12:00:00       NaN  Njoro   NaN  Physics
2003-10-02 06:00:00       4.0   Jane    4j      CRE
2005-01-01 00:00:00       5.0  njogu   NaN     comp

In [56]:
l1 = [5,7,8,9,3]
l2 = [4,5,7,23,5,6]
type(list(zip(l1,l2)))
a = list(zip(l1,l2))
print(a)
for i,v in a:
    print(i,v)

[(5, 4), (7, 5), (8, 7), (9, 23), (3, 5)]
5 4
7 5
8 7
9 23
3 5

In [57]:

{i:v for i,v in a}

{5: 4, 7: 5, 8: 7, 9: 23, 3: 5}

In [45]:
d = {}
for i,v in a:
    d[i] = v
    
d

{5: 4, 7: 5, 8: 7, 9: 23, 3: 5}

In [65]:
l = [6,4,6,7,8,4,2,4,5,7]

l2 = list(map(lambda x: x**2, l))

d = {}
for k,v in zip(l, l2):
    d[k]=v
d

{6: 36, 4: 16, 7: 49, 8: 64, 2: 4, 5: 25}